---
kind: property
id: P:Autodesk.Revit.DB.WorksetId.IntegerValue
source: html/53ff8e54-ece6-8aa3-a30c-bfb5cdef2ebb.htm
---
# Autodesk.Revit.DB.WorksetId.IntegerValue Property

Provides the value of the WorksetId as an integer.

## Syntax (C#)
```csharp
public int IntegerValue { get; }
```